mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
/*******************************************************************************
* I2SPRE_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ICCR;
        stc_i2spre_iccr_field_t ICCR_f;
        struct {
          union {
            __IO uint16_t ICCRL;
            struct {
              __IO uint8_t ICCRLL;
              __IO uint8_t ICCRLH;
            };
          };
          union {
            __IO uint16_t ICCRH;
            struct {
              __IO uint8_t ICCRHL;
              __IO uint8_t ICCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR1;
        stc_i2spre_ipcr1_field_t IPCR1_f;
        struct {
          union {
            __IO uint16_t IPCR1L;
            struct {
              __IO uint8_t IPCR1LL;
              __IO uint8_t IPCR1LH;
            };
          };
          union {
            __IO uint16_t IPCR1H;
            struct {
              __IO uint8_t IPCR1HL;
              __IO uint8_t IPCR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR2;
        stc_i2spre_ipcr2_field_t IPCR2_f;
        struct {
          union {
            __IO uint16_t IPCR2L;
            struct {
              __IO uint8_t IPCR2LL;
              __IO uint8_t IPCR2LH;
            };
          };
          union {
            __IO uint16_t IPCR2H;
            struct {
              __IO uint8_t IPCR2HL;
              __IO uint8_t IPCR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR3;
        stc_i2spre_ipcr3_field_t IPCR3_f;
        struct {
          union {
            __IO uint16_t IPCR3L;
            struct {
              __IO uint8_t IPCR3LL;
              __IO uint8_t IPCR3LH;
            };
          };
          union {
            __IO uint16_t IPCR3H;
            struct {
              __IO uint8_t IPCR3HL;
              __IO uint8_t IPCR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR4;
        stc_i2spre_ipcr4_field_t IPCR4_f;
        struct {
          union {
            __IO uint16_t IPCR4L;
            struct {
              __IO uint8_t IPCR4LL;
              __IO uint8_t IPCR4LH;
            };
          };
          union {
            __IO uint16_t IPCR4H;
            struct {
              __IO uint8_t IPCR4HL;
              __IO uint8_t IPCR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IP_STR;
        stc_i2spre_ip_str_field_t IP_STR_f;
        struct {
          union {
            __IO uint16_t IP_STRL;
            struct {
              __IO uint8_t IP_STRLL;
              __IO uint8_t IP_STRLH;
            };
          };
          union {
            __IO uint16_t IP_STRH;
            struct {
              __IO uint8_t IP_STRHL;
              __IO uint8_t IP_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_ENR;
        stc_i2spre_ipint_enr_field_t IPINT_ENR_f;
        struct {
          union {
            __IO uint16_t IPINT_ENRL;
            struct {
              __IO uint8_t IPINT_ENRLL;
              __IO uint8_t IPINT_ENRLH;
            };
          };
          union {
            __IO uint16_t IPINT_ENRH;
            struct {
              __IO uint8_t IPINT_ENRHL;
              __IO uint8_t IPINT_ENRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_CLR;
        stc_i2spre_ipint_clr_field_t IPINT_CLR_f;
        struct {
          union {
            __IO uint16_t IPINT_CLRL;
            struct {
              __IO uint8_t IPINT_CLRLL;
              __IO uint8_t IPINT_CLRLH;
            };
          };
          union {
            __IO uint16_t IPINT_CLRH;
            struct {
              __IO uint8_t IPINT_CLRHL;
              __IO uint8_t IPINT_CLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_STR;
        stc_i2spre_ipint_str_field_t IPINT_STR_f;
        struct {
          union {
            __IO uint16_t IPINT_STRL;
            struct {
              __IO uint8_t IPINT_STRLL;
              __IO uint8_t IPINT_STRLH;
            };
          };
          union {
            __IO uint16_t IPINT_STRH;
            struct {
              __IO uint8_t IPINT_STRHL;
              __IO uint8_t IPINT_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR5;
        stc_i2spre_ipcr5_field_t IPCR5_f;
        struct {
          union {
            __IO uint16_t IPCR5L;
            struct {
              __IO uint8_t IPCR5LL;
              __IO uint8_t IPCR5LH;
            };
          };
          union {
            __IO uint16_t IPCR5H;
            struct {
              __IO uint8_t IPCR5HL;
              __IO uint8_t IPCR5HH;
            };
          };
        };
    };
} FM_I2SPRE_TypeDef, FM4_I2SPRE_TypeDef;

/*******************************************************************************
* INTREQ_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t DRQSEL;
        stc_intreq_drqsel_field_t DRQSEL_f;
        struct {
          union {
            __IO uint16_t DRQSELL;
            struct {
              __IO uint8_t DRQSELLL;
              __IO uint8_t DRQSELLH;
            };
          };
          union {
            __IO uint16_t DRQSELH;
            struct {
              __IO uint8_t DRQSELHL;
              __IO uint8_t DRQSELHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[12];
    union {
        __IO  uint8_t ODDPKS;
        stc_intreq_oddpks_field_t ODDPKS_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t ODDPKS1;
        stc_intreq_oddpks1_field_t ODDPKS1_f;
    };
        __IO  uint8_t RESERVED2[251];
    union {
        __IO uint32_t IRQ003SEL;
        stc_intreq_irq003sel_field_t IRQ003SEL_f;
        struct {
          union {
            __IO uint16_t IRQ003SELL;
            struct {
              __IO uint8_t IRQ003SELLL;
              __IO uint8_t IRQ003SELLH;
            };
          };
          union {
            __IO uint16_t IRQ003SELH;
            struct {
              __IO uint8_t IRQ003SELHL;
              __IO uint8_t IRQ003SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ004SEL;
        stc_intreq_irq004sel_field_t IRQ004SEL_f;
        struct {
          union {
            __IO uint16_t IRQ004SELL;
            struct {
              __IO uint8_t IRQ004SELLL;
              __IO uint8_t IRQ004SELLH;
            };
          };
          union {
            __IO uint16_t IRQ004SELH;
            struct {
              __IO uint8_t IRQ004SELHL;
              __IO uint8_t IRQ004SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ005SEL;
        stc_intreq_irq005sel_field_t IRQ005SEL_f;
        struct {
          union {
            __IO uint16_t IRQ005SELL;
            struct {
              __IO uint8_t IRQ005SELLL;
              __IO uint8_t IRQ005SELLH;
            };
          };
          union {
            __IO uint16_t IRQ005SELH;
            struct {
              __IO uint8_t IRQ005SELHL;
              __IO uint8_t IRQ005SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ006SEL;
        stc_intreq_irq006sel_field_t IRQ006SEL_f;
        struct {
          union {
            __IO uint16_t IRQ006SELL;
            struct {
              __IO uint8_t IRQ006SELLL;
              __IO uint8_t IRQ006SELLH;
            };
          };
          union {
            __IO uint16_t IRQ006SELH;
            struct {
              __IO uint8_t IRQ006SELHL;
              __IO uint8_t IRQ006SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ007SEL;
        stc_intreq_irq007sel_field_t IRQ007SEL_f;
        struct {
          union {
            __IO uint16_t IRQ007SELL;
            struct {
              __IO uint8_t IRQ007SELLL;
              __IO uint8_t IRQ007SELLH;
            };
          };
          union {
            __IO uint16_t IRQ007SELH;
            struct {
              __IO uint8_t IRQ007SELHL;
              __IO uint8_t IRQ007SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ008SEL;
        stc_intreq_irq008sel_field_t IRQ008SEL_f;
        struct {
          union {
            __IO uint16_t IRQ008SELL;
            struct {
              __IO uint8_t IRQ008SELLL;
              __IO uint8_t IRQ008SELLH;
            };
          };
          union {
            __IO uint16_t IRQ008SELH;
            struct {
              __IO uint8_t IRQ008SELHL;
              __IO uint8_t IRQ008SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ009SEL;
        stc_intreq_irq009sel_field_t IRQ009SEL_f;
        struct {
          union {
            __IO uint16_t IRQ009SELL;
            struct {
              __IO uint8_t IRQ009SELLL;
              __IO uint8_t IRQ009SELLH;
            };
          };
          union {
            __IO uint16_t IRQ009SELH;
            struct {
              __IO uint8_t IRQ009SELHL;
              __IO uint8_t IRQ009SELHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ010SEL;
        stc_intreq_irq010sel_field_t IRQ010SEL_f;
        struct {
          union {
            __IO uint16_t IRQ010SELL;
            struct {
              __IO uint8_t IRQ010SELLL;
              __IO uint8_t IRQ010SELLH;
            };
          };
          union {
            __IO uint16_t IRQ010SELH;
            struct {
              __IO uint8_t IRQ010SELHL;
              __IO uint8_t IRQ010SELHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[208];
    union {
        __IO uint32_t EXC02MON;
        stc_intreq_exc02mon_field_t EXC02MON_f;
        struct {
          union {
            __IO uint16_t EXC02MONL;
            struct {
              __IO uint8_t EXC02MONLL;
              __IO uint8_t EXC02MONLH;
            };
          };
          union {
            __IO uint16_t EXC02MONH;
            struct {
              __IO uint8_t EXC02MONHL;
              __IO uint8_t EXC02MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ000MON;
        stc_intreq_irq000mon_field_t IRQ000MON_f;
        struct {
          union {
            __IO uint16_t IRQ000MONL;
            struct {
              __IO uint8_t IRQ000MONLL;
              __IO uint8_t IRQ000MONLH;
            };
          };
          union {
            __IO uint16_t IRQ000MONH;
            struct {
              __IO uint8_t IRQ000MONHL;
              __IO uint8_t IRQ000MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ001MON;
        stc_intreq_irq001mon_field_t IRQ001MON_f;
        struct {
          union {
            __IO uint16_t IRQ001MONL;
            struct {
              __IO uint8_t IRQ001MONLL;
              __IO uint8_t IRQ001MONLH;
            };
          };
          union {
            __IO uint16_t IRQ001MONH;
            struct {
              __IO uint8_t IRQ001MONHL;
              __IO uint8_t IRQ001MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ002MON;
        stc_intreq_irq002mon_field_t IRQ002MON_f;
        struct {
          union {
            __IO uint16_t IRQ002MONL;
            struct {
              __IO uint8_t IRQ002MONLL;
              __IO uint8_t IRQ002MONLH;
            };
          };
          union {
            __IO uint16_t IRQ002MONH;
            struct {
              __IO uint8_t IRQ002MONHL;
              __IO uint8_t IRQ002MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ003MON;
        stc_intreq_irq003mon_field_t IRQ003MON_f;
        struct {
          union {
            __IO uint16_t IRQ003MONL;
            struct {
              __IO uint8_t IRQ003MONLL;
              __IO uint8_t IRQ003MONLH;
            };
          };
          union {
            __IO uint16_t IRQ003MONH;
            struct {
              __IO uint8_t IRQ003MONHL;
              __IO uint8_t IRQ003MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ004MON;
        stc_intreq_irq004mon_field_t IRQ004MON_f;
        struct {
          union {
            __IO uint16_t IRQ004MONL;
            struct {
              __IO uint8_t IRQ004MONLL;
              __IO uint8_t IRQ004MONLH;
            };
          };
          union {
            __IO uint16_t IRQ004MONH;
            struct {
              __IO uint8_t IRQ004MONHL;
              __IO uint8_t IRQ004MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ005MON;
        stc_intreq_irq005mon_field_t IRQ005MON_f;
        struct {
          union {
            __IO uint16_t IRQ005MONL;
            struct {
              __IO uint8_t IRQ005MONLL;
              __IO uint8_t IRQ005MONLH;
            };
          };
          union {
            __IO uint16_t IRQ005MONH;
            struct {
              __IO uint8_t IRQ005MONHL;
              __IO uint8_t IRQ005MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ006MON;
        stc_intreq_irq006mon_field_t IRQ006MON_f;
        struct {
          union {
            __IO uint16_t IRQ006MONL;
            struct {
              __IO uint8_t IRQ006MONLL;
              __IO uint8_t IRQ006MONLH;
            };
          };
          union {
            __IO uint16_t IRQ006MONH;
            struct {
              __IO uint8_t IRQ006MONHL;
              __IO uint8_t IRQ006MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ007MON;
        stc_intreq_irq007mon_field_t IRQ007MON_f;
        struct {
          union {
            __IO uint16_t IRQ007MONL;
            struct {
              __IO uint8_t IRQ007MONLL;
              __IO uint8_t IRQ007MONLH;
            };
          };
          union {
            __IO uint16_t IRQ007MONH;
            struct {
              __IO uint8_t IRQ007MONHL;
              __IO uint8_t IRQ007MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ008MON;
        stc_intreq_irq008mon_field_t IRQ008MON_f;
        struct {
          union {
            __IO uint16_t IRQ008MONL;
            struct {
              __IO uint8_t IRQ008MONLL;
              __IO uint8_t IRQ008MONLH;
            };
          };
          union {
            __IO uint16_t IRQ008MONH;
            struct {
              __IO uint8_t IRQ008MONHL;
              __IO uint8_t IRQ008MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ009MON;
        stc_intreq_irq009mon_field_t IRQ009MON_f;
        struct {
          union {
            __IO uint16_t IRQ009MONL;
            struct {
              __IO uint8_t IRQ009MONLL;
              __IO uint8_t IRQ009MONLH;
            };
          };
          union {
            __IO uint16_t IRQ009MONH;
            struct {
              __IO uint8_t IRQ009MONHL;
              __IO uint8_t IRQ009MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ010MON;
        stc_intreq_irq010mon_field_t IRQ010MON_f;
        struct {
          union {
            __IO uint16_t IRQ010MONL;
            struct {
              __IO uint8_t IRQ010MONLL;
              __IO uint8_t IRQ010MONLH;
            };
          };
          union {
            __IO uint16_t IRQ010MONH;
            struct {
              __IO uint8_t IRQ010MONHL;
              __IO uint8_t IRQ010MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ011MON;
        stc_intreq_irq011mon_field_t IRQ011MON_f;
        struct {
          union {
            __IO uint16_t IRQ011MONL;
            struct {
              __IO uint8_t IRQ011MONLL;
              __IO uint8_t IRQ011MONLH;
            };
          };
          union {
            __IO uint16_t IRQ011MONH;
            struct {
              __IO uint8_t IRQ011MONHL;
              __IO uint8_t IRQ011MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ012MON;
        stc_intreq_irq012mon_field_t IRQ012MON_f;
        struct {
          union {
            __IO uint16_t IRQ012MONL;
            struct {
              __IO uint8_t IRQ012MONLL;
              __IO uint8_t IRQ012MONLH;
            };
          };
          union {
            __IO uint16_t IRQ012MONH;
            struct {
              __IO uint8_t IRQ012MONHL;
              __IO uint8_t IRQ012MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ013MON;
        stc_intreq_irq013mon_field_t IRQ013MON_f;
        struct {
          union {
            __IO uint16_t IRQ013MONL;
            struct {
              __IO uint8_t IRQ013MONLL;
              __IO uint8_t IRQ013MONLH;
            };
          };
          union {
            __IO uint16_t IRQ013MONH;
            struct {
              __IO uint8_t IRQ013MONHL;
              __IO uint8_t IRQ013MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ014MON;
        stc_intreq_irq014mon_field_t IRQ014MON_f;
        struct {
          union {
            __IO uint16_t IRQ014MONL;
            struct {
              __IO uint8_t IRQ014MONLL;
              __IO uint8_t IRQ014MONLH;
            };
          };
          union {
            __IO uint16_t IRQ014MONH;
            struct {
              __IO uint8_t IRQ014MONHL;
              __IO uint8_t IRQ014MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ015MON;
        stc_intreq_irq015mon_field_t IRQ015MON_f;
        struct {
          union {
            __IO uint16_t IRQ015MONL;
            struct {
              __IO uint8_t IRQ015MONLL;
              __IO uint8_t IRQ015MONLH;
            };
          };
          union {
            __IO uint16_t IRQ015MONH;
            struct {
              __IO uint8_t IRQ015MONHL;
              __IO uint8_t IRQ015MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ016MON;
        stc_intreq_irq016mon_field_t IRQ016MON_f;
        struct {
          union {
            __IO uint16_t IRQ016MONL;
            struct {
              __IO uint8_t IRQ016MONLL;
              __IO uint8_t IRQ016MONLH;
            };
          };
          union {
            __IO uint16_t IRQ016MONH;
            struct {
              __IO uint8_t IRQ016MONHL;
              __IO uint8_t IRQ016MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ017MON;
        stc_intreq_irq017mon_field_t IRQ017MON_f;
        struct {
          union {
            __IO uint16_t IRQ017MONL;
            struct {
              __IO uint8_t IRQ017MONLL;
              __IO uint8_t IRQ017MONLH;
            };
          };
          union {
            __IO uint16_t IRQ017MONH;
            struct {
              __IO uint8_t IRQ017MONHL;
              __IO uint8_t IRQ017MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ018MON;
        stc_intreq_irq018mon_field_t IRQ018MON_f;
        struct {
          union {
            __IO uint16_t IRQ018MONL;
            struct {
              __IO uint8_t IRQ018MONLL;
              __IO uint8_t IRQ018MONLH;
            };
          };
          union {
            __IO uint16_t IRQ018MONH;
            struct {
              __IO uint8_t IRQ018MONHL;
              __IO uint8_t IRQ018MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ019MON;
        stc_intreq_irq019mon_field_t IRQ019MON_f;
        struct {
          union {
            __IO uint16_t IRQ019MONL;
            struct {
              __IO uint8_t IRQ019MONLL;
              __IO uint8_t IRQ019MONLH;
            };
          };
          union {
            __IO uint16_t IRQ019MONH;
            struct {
              __IO uint8_t IRQ019MONHL;
              __IO uint8_t IRQ019MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ020MON;
        stc_intreq_irq020mon_field_t IRQ020MON_f;
        struct {
          union {
            __IO uint16_t IRQ020MONL;
            struct {
              __IO uint8_t IRQ020MONLL;
              __IO uint8_t IRQ020MONLH;
            };
          };
          union {
            __IO uint16_t IRQ020MONH;
            struct {
              __IO uint8_t IRQ020MONHL;
              __IO uint8_t IRQ020MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ021MON;
        stc_intreq_irq021mon_field_t IRQ021MON_f;
        struct {
          union {
            __IO uint16_t IRQ021MONL;
            struct {
              __IO uint8_t IRQ021MONLL;
              __IO uint8_t IRQ021MONLH;
            };
          };
          union {
            __IO uint16_t IRQ021MONH;
            struct {
              __IO uint8_t IRQ021MONHL;
              __IO uint8_t IRQ021MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ022MON;
        stc_intreq_irq022mon_field_t IRQ022MON_f;
        struct {
          union {
            __IO uint16_t IRQ022MONL;
            struct {
              __IO uint8_t IRQ022MONLL;
              __IO uint8_t IRQ022MONLH;
            };
          };
          union {
            __IO uint16_t IRQ022MONH;
            struct {
              __IO uint8_t IRQ022MONHL;
              __IO uint8_t IRQ022MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ023MON;
        stc_intreq_irq023mon_field_t IRQ023MON_f;
        struct {
          union {
            __IO uint16_t IRQ023MONL;
            struct {
              __IO uint8_t IRQ023MONLL;
              __IO uint8_t IRQ023MONLH;
            };
          };
          union {
            __IO uint16_t IRQ023MONH;
            struct {
              __IO uint8_t IRQ023MONHL;
              __IO uint8_t IRQ023MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ024MON;
        stc_intreq_irq024mon_field_t IRQ024MON_f;
        struct {
          union {
            __IO uint16_t IRQ024MONL;
            struct {
              __IO uint8_t IRQ024MONLL;
              __IO uint8_t IRQ024MONLH;
            };
          };
          union {
            __IO uint16_t IRQ024MONH;
            struct {
              __IO uint8_t IRQ024MONHL;
              __IO uint8_t IRQ024MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ025MON;
