mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
/*******************************************************************************
* MFS Registers MFS9
*   Register Definition
*******************************************************************************/
#define FM_MFS9_CSIO_SMR                          *((volatile  uint8_t*)(0x40038900UL))
#define FM4_MFS9_CSIO_SMR                         *((volatile  uint8_t*)(0x40038900UL))
#define FM_MFS9_I2C_SMR                           *((volatile  uint8_t*)(0x40038900UL))
#define FM4_MFS9_I2C_SMR                          *((volatile  uint8_t*)(0x40038900UL))
#define FM_MFS9_LIN_SMR                           *((volatile  uint8_t*)(0x40038900UL))
#define FM4_MFS9_LIN_SMR                          *((volatile  uint8_t*)(0x40038900UL))
#define FM_MFS9_UART_SMR                          *((volatile  uint8_t*)(0x40038900UL))
#define FM4_MFS9_UART_SMR                         *((volatile  uint8_t*)(0x40038900UL))
#define FM_MFS9_CSIO_SCR                          *((volatile  uint8_t*)(0x40038901UL))
#define FM4_MFS9_CSIO_SCR                         *((volatile  uint8_t*)(0x40038901UL))
#define FM_MFS9_I2C_IBCR                          *((volatile  uint8_t*)(0x40038901UL))
#define FM4_MFS9_I2C_IBCR                         *((volatile  uint8_t*)(0x40038901UL))
#define FM_MFS9_LIN_SCR                           *((volatile  uint8_t*)(0x40038901UL))
#define FM4_MFS9_LIN_SCR                          *((volatile  uint8_t*)(0x40038901UL))
#define FM_MFS9_UART_SCR                          *((volatile  uint8_t*)(0x40038901UL))
#define FM4_MFS9_UART_SCR                         *((volatile  uint8_t*)(0x40038901UL))
#define FM_MFS9_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038904UL))
#define FM4_MFS9_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038904UL))
#define FM_MFS9_I2C_IBSR                          *((volatile  uint8_t*)(0x40038904UL))
#define FM4_MFS9_I2C_IBSR                         *((volatile  uint8_t*)(0x40038904UL))
#define FM_MFS9_LIN_ESCR                          *((volatile  uint8_t*)(0x40038904UL))
#define FM4_MFS9_LIN_ESCR                         *((volatile  uint8_t*)(0x40038904UL))
#define FM_MFS9_UART_ESCR                         *((volatile  uint8_t*)(0x40038904UL))
#define FM4_MFS9_UART_ESCR                        *((volatile  uint8_t*)(0x40038904UL))
#define FM_MFS9_CSIO_SSR                          *((volatile  uint8_t*)(0x40038905UL))
#define FM4_MFS9_CSIO_SSR                         *((volatile  uint8_t*)(0x40038905UL))
#define FM_MFS9_I2C_SSR                           *((volatile  uint8_t*)(0x40038905UL))
#define FM4_MFS9_I2C_SSR                          *((volatile  uint8_t*)(0x40038905UL))
#define FM_MFS9_LIN_SSR                           *((volatile  uint8_t*)(0x40038905UL))
#define FM4_MFS9_LIN_SSR                          *((volatile  uint8_t*)(0x40038905UL))
#define FM_MFS9_UART_SSR                          *((volatile  uint8_t*)(0x40038905UL))
#define FM4_MFS9_UART_SSR                         *((volatile  uint8_t*)(0x40038905UL))
#define FM_MFS9_CSIO_RDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_CSIO_RDR                         *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_CSIO_TDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_CSIO_TDR                         *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_I2C_RDR                           *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_I2C_RDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_I2C_TDR                           *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_I2C_TDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_LIN_RDR                           *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_LIN_RDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_LIN_TDR                           *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_LIN_TDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_UART_RDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_UART_RDR                         *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_UART_TDR                          *((volatile uint16_t*)(0x40038908UL))
#define FM4_MFS9_UART_TDR                         *((volatile uint16_t*)(0x40038908UL))
#define FM_MFS9_CSIO_BGR                          *((volatile uint16_t*)(0x4003890CUL))
#define FM4_MFS9_CSIO_BGR                         *((volatile uint16_t*)(0x4003890CUL))
#define FM_MFS9_I2C_BGR                           *((volatile uint16_t*)(0x4003890CUL))
#define FM4_MFS9_I2C_BGR                          *((volatile uint16_t*)(0x4003890CUL))
#define FM_MFS9_LIN_BGR                           *((volatile uint16_t*)(0x4003890CUL))
#define FM4_MFS9_LIN_BGR                          *((volatile uint16_t*)(0x4003890CUL))
#define FM_MFS9_UART_BGR                          *((volatile uint16_t*)(0x4003890CUL))
#define FM4_MFS9_UART_BGR                         *((volatile uint16_t*)(0x4003890CUL))
#define FM_MFS9_I2C_ISBA                          *((volatile  uint8_t*)(0x40038910UL))
#define FM4_MFS9_I2C_ISBA                         *((volatile  uint8_t*)(0x40038910UL))
#define FM_MFS9_I2C_ISMK                          *((volatile  uint8_t*)(0x40038911UL))
#define FM4_MFS9_I2C_ISMK                         *((volatile  uint8_t*)(0x40038911UL))
#define FM_MFS9_CSIO_FCR                          *((volatile uint16_t*)(0x40038914UL))
#define FM4_MFS9_CSIO_FCR                         *((volatile uint16_t*)(0x40038914UL))
#define FM_MFS9_I2C_FCR                           *((volatile uint16_t*)(0x40038914UL))
#define FM4_MFS9_I2C_FCR                          *((volatile uint16_t*)(0x40038914UL))
#define FM_MFS9_LIN_FCR                           *((volatile uint16_t*)(0x40038914UL))
#define FM4_MFS9_LIN_FCR                          *((volatile uint16_t*)(0x40038914UL))
#define FM_MFS9_UART_FCR                          *((volatile uint16_t*)(0x40038914UL))
#define FM4_MFS9_UART_FCR                         *((volatile uint16_t*)(0x40038914UL))
#define FM_MFS9_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038918UL))
#define FM4_MFS9_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038918UL))
#define FM_MFS9_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038918UL))
#define FM4_MFS9_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038918UL))
#define FM_MFS9_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038918UL))
#define FM4_MFS9_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038918UL))
#define FM_MFS9_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038918UL))
#define FM4_MFS9_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038918UL))
#define FM_MFS9_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038919UL))
#define FM4_MFS9_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038919UL))
#define FM_MFS9_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038919UL))
#define FM4_MFS9_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038919UL))
#define FM_MFS9_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038919UL))
#define FM4_MFS9_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038919UL))
#define FM_MFS9_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038919UL))
#define FM4_MFS9_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038919UL))
#define FM_MFS9_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003891CUL))
#define FM4_MFS9_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x4003891CUL))
#define FM_MFS9_I2C_NFCR                          *((volatile  uint8_t*)(0x4003891CUL))
#define FM4_MFS9_I2C_NFCR                         *((volatile  uint8_t*)(0x4003891CUL))
#define FM_MFS9_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003891DUL))
#define FM4_MFS9_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x4003891DUL))
#define FM_MFS9_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003891DUL))
#define FM4_MFS9_I2C_EIBCR                        *((volatile  uint8_t*)(0x4003891DUL))
#define FM_MFS9_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038920UL))
#define FM4_MFS9_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038920UL))
#define FM_MFS9_CSIO_SACSR                        *((volatile uint16_t*)(0x40038924UL))
#define FM4_MFS9_CSIO_SACSR                       *((volatile uint16_t*)(0x40038924UL))
#define FM_MFS9_CSIO_STMR                         *((volatile uint16_t*)(0x40038928UL))
#define FM4_MFS9_CSIO_STMR                        *((volatile uint16_t*)(0x40038928UL))
#define FM_MFS9_CSIO_STMCR                        *((volatile uint16_t*)(0x4003892CUL))
#define FM4_MFS9_CSIO_STMCR                       *((volatile uint16_t*)(0x4003892CUL))
#define FM_MFS9_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038930UL))
#define FM4_MFS9_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038930UL))
#define FM_MFS9_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038934UL))
#define FM4_MFS9_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038934UL))
#define FM_MFS9_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038935UL))
#define FM4_MFS9_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038935UL))
#define FM_MFS9_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038938UL))
#define FM4_MFS9_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038938UL))
#define FM_MFS9_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003893CUL))
#define FM4_MFS9_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x4003893CUL))
#define FM_MFS9_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003893DUL))
#define FM4_MFS9_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x4003893DUL))
#define FM_MFS9_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038940UL))
#define FM4_MFS9_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038940UL))
#define FM_MFS9_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038941UL))
#define FM4_MFS9_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038941UL))

