mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
#define bFM_GPIO_DDR4_P0                          *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P0                         *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM_GPIO_DDR4_P1                          *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P1                         *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM_GPIO_DDR4_P2                          *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P2                         *((volatile  uint8_t *)(0x42DE4208UL))
#define bFM_GPIO_DDR4_P3                          *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P3                         *((volatile  uint8_t *)(0x42DE420CUL))
#define bFM_GPIO_DDR4_P4                          *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P4                         *((volatile  uint8_t *)(0x42DE4210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P5                         *((volatile  uint8_t *)(0x42DE4214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM_GPIO_DDR4_PA                          *((volatile  uint8_t *)(0x42DE4228UL))
#define bFM4_GPIO_DDR4_PA                         *((volatile  uint8_t *)(0x42DE4228UL))
#define bFM_GPIO_DDR4_PB                          *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PB                         *((volatile  uint8_t *)(0x42DE422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PC                         *((volatile  uint8_t *)(0x42DE4230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PD                         *((volatile  uint8_t *)(0x42DE4234UL))
#define bFM_GPIO_DDR4_PE                          *((volatile  uint8_t *)(0x42DE4238UL))
#define bFM4_GPIO_DDR4_PE                         *((volatile  uint8_t *)(0x42DE4238UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P0                         *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P1                         *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P2                         *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P3                         *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P7                         *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM_GPIO_DDR5_P8                          *((volatile  uint8_t *)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P8                         *((volatile  uint8_t *)(0x42DE42A0UL))
#define bFM_GPIO_DDR5_P9                          *((volatile  uint8_t *)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_P9                         *((volatile  uint8_t *)(0x42DE42A4UL))
#define bFM_GPIO_DDR5_PA                          *((volatile  uint8_t *)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_PA                         *((volatile  uint8_t *)(0x42DE42A8UL))
#define bFM_GPIO_DDR5_PB                          *((volatile  uint8_t *)(0x42DE42ACUL))
#define bFM4_GPIO_DDR5_PB                         *((volatile  uint8_t *)(0x42DE42ACUL))
#define bFM_GPIO_DDR5_PC                          *((volatile  uint8_t *)(0x42DE42B0UL))
#define bFM4_GPIO_DDR5_PC                         *((volatile  uint8_t *)(0x42DE42B0UL))
#define bFM_GPIO_DDR5_PD                          *((volatile  uint8_t *)(0x42DE42B4UL))
#define bFM4_GPIO_DDR5_PD                         *((volatile  uint8_t *)(0x42DE42B4UL))
#define bFM_GPIO_DDR5_PE                          *((volatile  uint8_t *)(0x42DE42B8UL))
#define bFM4_GPIO_DDR5_PE                         *((volatile  uint8_t *)(0x42DE42B8UL))
#define bFM_GPIO_DDR5_PF                          *((volatile  uint8_t *)(0x42DE42BCUL))
#define bFM4_GPIO_DDR5_PF                         *((volatile  uint8_t *)(0x42DE42BCUL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P2                         *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P3                         *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM_GPIO_DDR6_P4                          *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P4                         *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM_GPIO_DDR6_P5                          *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P5                         *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM_GPIO_DDR6_P6                          *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P6                         *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM_GPIO_DDR6_P7                          *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P7                         *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM_GPIO_DDR6_P8                          *((volatile  uint8_t *)(0x42DE4320UL))
#define bFM4_GPIO_DDR6_P8                         *((volatile  uint8_t *)(0x42DE4320UL))
#define bFM_GPIO_DDR6_P9                          *((volatile  uint8_t *)(0x42DE4324UL))
#define bFM4_GPIO_DDR6_P9                         *((volatile  uint8_t *)(0x42DE4324UL))
#define bFM_GPIO_DDR6_PA                          *((volatile  uint8_t *)(0x42DE4328UL))
#define bFM4_GPIO_DDR6_PA                         *((volatile  uint8_t *)(0x42DE4328UL))
#define bFM_GPIO_DDR6_PB                          *((volatile  uint8_t *)(0x42DE432CUL))
#define bFM4_GPIO_DDR6_PB                         *((volatile  uint8_t *)(0x42DE432CUL))
#define bFM_GPIO_DDR6_PC                          *((volatile  uint8_t *)(0x42DE4330UL))
#define bFM4_GPIO_DDR6_PC                         *((volatile  uint8_t *)(0x42DE4330UL))
#define bFM_GPIO_DDR6_PD                          *((volatile  uint8_t *)(0x42DE4334UL))
#define bFM4_GPIO_DDR6_PD                         *((volatile  uint8_t *)(0x42DE4334UL))
#define bFM_GPIO_DDR6_PE                          *((volatile  uint8_t *)(0x42DE4338UL))
#define bFM4_GPIO_DDR6_PE                         *((volatile  uint8_t *)(0x42DE4338UL))

#define bFM_GPIO_DDR7_P0                          *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P0                         *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P1                         *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P2                         *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P3                         *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P4                         *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM_GPIO_DDR7_P5                          *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM4_GPIO_DDR7_P5                         *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM_GPIO_DDR7_P6                          *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM4_GPIO_DDR7_P6                         *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM_GPIO_DDR7_P7                          *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM4_GPIO_DDR7_P7                         *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM_GPIO_DDR7_P8                          *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM4_GPIO_DDR7_P8                         *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM_GPIO_DDR7_P9                          *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM4_GPIO_DDR7_P9                         *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM_GPIO_DDR7_PA                          *((volatile  uint8_t *)(0x42DE43A8UL))
#define bFM4_GPIO_DDR7_PA                         *((volatile  uint8_t *)(0x42DE43A8UL))
#define bFM_GPIO_DDR7_PB                          *((volatile  uint8_t *)(0x42DE43ACUL))
#define bFM4_GPIO_DDR7_PB                         *((volatile  uint8_t *)(0x42DE43ACUL))
#define bFM_GPIO_DDR7_PC                          *((volatile  uint8_t *)(0x42DE43B0UL))
#define bFM4_GPIO_DDR7_PC                         *((volatile  uint8_t *)(0x42DE43B0UL))
#define bFM_GPIO_DDR7_PD                          *((volatile  uint8_t *)(0x42DE43B4UL))
#define bFM4_GPIO_DDR7_PD                         *((volatile  uint8_t *)(0x42DE43B4UL))
#define bFM_GPIO_DDR7_PE                          *((volatile  uint8_t *)(0x42DE43B8UL))
#define bFM4_GPIO_DDR7_PE                         *((volatile  uint8_t *)(0x42DE43B8UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM_GPIO_DDR8_P2                          *((volatile  uint8_t *)(0x42DE4408UL))
#define bFM4_GPIO_DDR8_P2                         *((volatile  uint8_t *)(0x42DE4408UL))
#define bFM_GPIO_DDR8_P3                          *((volatile  uint8_t *)(0x42DE440CUL))
#define bFM4_GPIO_DDR8_P3                         *((volatile  uint8_t *)(0x42DE440CUL))

#define bFM_GPIO_DDR9_P0                          *((volatile  uint8_t *)(0x42DE4480UL))
#define bFM4_GPIO_DDR9_P0                         *((volatile  uint8_t *)(0x42DE4480UL))
#define bFM_GPIO_DDR9_P1                          *((volatile  uint8_t *)(0x42DE4484UL))
#define bFM4_GPIO_DDR9_P1                         *((volatile  uint8_t *)(0x42DE4484UL))
#define bFM_GPIO_DDR9_P2                          *((volatile  uint8_t *)(0x42DE4488UL))
#define bFM4_GPIO_DDR9_P2                         *((volatile  uint8_t *)(0x42DE4488UL))
#define bFM_GPIO_DDR9_P3                          *((volatile  uint8_t *)(0x42DE448CUL))
#define bFM4_GPIO_DDR9_P3                         *((volatile  uint8_t *)(0x42DE448CUL))
#define bFM_GPIO_DDR9_P4                          *((volatile  uint8_t *)(0x42DE4490UL))
#define bFM4_GPIO_DDR9_P4                         *((volatile  uint8_t *)(0x42DE4490UL))
#define bFM_GPIO_DDR9_P5                          *((volatile  uint8_t *)(0x42DE4494UL))
#define bFM4_GPIO_DDR9_P5                         *((volatile  uint8_t *)(0x42DE4494UL))
#define bFM_GPIO_DDR9_P6                          *((volatile  uint8_t *)(0x42DE4498UL))
#define bFM4_GPIO_DDR9_P6                         *((volatile  uint8_t *)(0x42DE4498UL))
#define bFM_GPIO_DDR9_P7                          *((volatile  uint8_t *)(0x42DE449CUL))
#define bFM4_GPIO_DDR9_P7                         *((volatile  uint8_t *)(0x42DE449CUL))

#define bFM_GPIO_DDRA_P0                          *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM4_GPIO_DDRA_P0                         *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM_GPIO_DDRA_P1                          *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM4_GPIO_DDRA_P1                         *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM_GPIO_DDRA_P2                          *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM4_GPIO_DDRA_P2                         *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM_GPIO_DDRA_P3                          *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM4_GPIO_DDRA_P3                         *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM_GPIO_DDRA_P4                          *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM4_GPIO_DDRA_P4                         *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM_GPIO_DDRA_P5                          *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM4_GPIO_DDRA_P5                         *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM_GPIO_DDRA_P6                          *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM4_GPIO_DDRA_P6                         *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM_GPIO_DDRA_P7                          *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM4_GPIO_DDRA_P7                         *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM_GPIO_DDRA_P8                          *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM4_GPIO_DDRA_P8                         *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM_GPIO_DDRA_P9                          *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM4_GPIO_DDRA_P9                         *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM_GPIO_DDRA_PA                          *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM4_GPIO_DDRA_PA                         *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM_GPIO_DDRA_PB                          *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM4_GPIO_DDRA_PB                         *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM_GPIO_DDRA_PC                          *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM4_GPIO_DDRA_PC                         *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM_GPIO_DDRA_PD                          *((volatile  uint8_t *)(0x42DE4534UL))
#define bFM4_GPIO_DDRA_PD                         *((volatile  uint8_t *)(0x42DE4534UL))
#define bFM_GPIO_DDRA_PE                          *((volatile  uint8_t *)(0x42DE4538UL))
#define bFM4_GPIO_DDRA_PE                         *((volatile  uint8_t *)(0x42DE4538UL))
#define bFM_GPIO_DDRA_PF                          *((volatile  uint8_t *)(0x42DE453CUL))
#define bFM4_GPIO_DDRA_PF                         *((volatile  uint8_t *)(0x42DE453CUL))

#define bFM_GPIO_DDRB_P0                          *((volatile  uint8_t *)(0x42DE4580UL))
#define bFM4_GPIO_DDRB_P0                         *((volatile  uint8_t *)(0x42DE4580UL))
#define bFM_GPIO_DDRB_P1                          *((volatile  uint8_t *)(0x42DE4584UL))
#define bFM4_GPIO_DDRB_P1                         *((volatile  uint8_t *)(0x42DE4584UL))
#define bFM_GPIO_DDRB_P2                          *((volatile  uint8_t *)(0x42DE4588UL))
#define bFM4_GPIO_DDRB_P2                         *((volatile  uint8_t *)(0x42DE4588UL))
#define bFM_GPIO_DDRB_P3                          *((volatile  uint8_t *)(0x42DE458CUL))
#define bFM4_GPIO_DDRB_P3                         *((volatile  uint8_t *)(0x42DE458CUL))
#define bFM_GPIO_DDRB_P4                          *((volatile  uint8_t *)(0x42DE4590UL))
#define bFM4_GPIO_DDRB_P4                         *((volatile  uint8_t *)(0x42DE4590UL))
#define bFM_GPIO_DDRB_P5                          *((volatile  uint8_t *)(0x42DE4594UL))
#define bFM4_GPIO_DDRB_P5                         *((volatile  uint8_t *)(0x42DE4594UL))
#define bFM_GPIO_DDRB_P6                          *((volatile  uint8_t *)(0x42DE4598UL))
#define bFM4_GPIO_DDRB_P6                         *((volatile  uint8_t *)(0x42DE4598UL))
#define bFM_GPIO_DDRB_P7                          *((volatile  uint8_t *)(0x42DE459CUL))
#define bFM4_GPIO_DDRB_P7                         *((volatile  uint8_t *)(0x42DE459CUL))
#define bFM_GPIO_DDRB_P8                          *((volatile  uint8_t *)(0x42DE45A0UL))
#define bFM4_GPIO_DDRB_P8                         *((volatile  uint8_t *)(0x42DE45A0UL))
#define bFM_GPIO_DDRB_P9                          *((volatile  uint8_t *)(0x42DE45A4UL))
#define bFM4_GPIO_DDRB_P9                         *((volatile  uint8_t *)(0x42DE45A4UL))
#define bFM_GPIO_DDRB_PA                          *((volatile  uint8_t *)(0x42DE45A8UL))
#define bFM4_GPIO_DDRB_PA                         *((volatile  uint8_t *)(0x42DE45A8UL))
#define bFM_GPIO_DDRB_PB                          *((volatile  uint8_t *)(0x42DE45ACUL))
#define bFM4_GPIO_DDRB_PB                         *((volatile  uint8_t *)(0x42DE45ACUL))
#define bFM_GPIO_DDRB_PC                          *((volatile  uint8_t *)(0x42DE45B0UL))
#define bFM4_GPIO_DDRB_PC                         *((volatile  uint8_t *)(0x42DE45B0UL))
#define bFM_GPIO_DDRB_PD                          *((volatile  uint8_t *)(0x42DE45B4UL))
#define bFM4_GPIO_DDRB_PD                         *((volatile  uint8_t *)(0x42DE45B4UL))
#define bFM_GPIO_DDRB_PE                          *((volatile  uint8_t *)(0x42DE45B8UL))
#define bFM4_GPIO_DDRB_PE                         *((volatile  uint8_t *)(0x42DE45B8UL))
#define bFM_GPIO_DDRB_PF                          *((volatile  uint8_t *)(0x42DE45BCUL))
#define bFM4_GPIO_DDRB_PF                         *((volatile  uint8_t *)(0x42DE45BCUL))

