mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
#define bFM_GPIO_PDSRB_P0                         *((volatile  uint8_t *)(0x42DEED80UL))
#define bFM4_GPIO_PDSRB_P0                        *((volatile  uint8_t *)(0x42DEED80UL))
#define bFM_GPIO_PDSRB_P1                         *((volatile  uint8_t *)(0x42DEED84UL))
#define bFM4_GPIO_PDSRB_P1                        *((volatile  uint8_t *)(0x42DEED84UL))
#define bFM_GPIO_PDSRB_P2                         *((volatile  uint8_t *)(0x42DEED88UL))
#define bFM4_GPIO_PDSRB_P2                        *((volatile  uint8_t *)(0x42DEED88UL))
#define bFM_GPIO_PDSRB_P3                         *((volatile  uint8_t *)(0x42DEED8CUL))
#define bFM4_GPIO_PDSRB_P3                        *((volatile  uint8_t *)(0x42DEED8CUL))
#define bFM_GPIO_PDSRB_P4                         *((volatile  uint8_t *)(0x42DEED90UL))
#define bFM4_GPIO_PDSRB_P4                        *((volatile  uint8_t *)(0x42DEED90UL))
#define bFM_GPIO_PDSRB_P5                         *((volatile  uint8_t *)(0x42DEED94UL))
#define bFM4_GPIO_PDSRB_P5                        *((volatile  uint8_t *)(0x42DEED94UL))
#define bFM_GPIO_PDSRB_P6                         *((volatile  uint8_t *)(0x42DEED98UL))
#define bFM4_GPIO_PDSRB_P6                        *((volatile  uint8_t *)(0x42DEED98UL))
#define bFM_GPIO_PDSRB_P7                         *((volatile  uint8_t *)(0x42DEED9CUL))
#define bFM4_GPIO_PDSRB_P7                        *((volatile  uint8_t *)(0x42DEED9CUL))
#define bFM_GPIO_PDSRB_P8                         *((volatile  uint8_t *)(0x42DEEDA0UL))
#define bFM4_GPIO_PDSRB_P8                        *((volatile  uint8_t *)(0x42DEEDA0UL))
#define bFM_GPIO_PDSRB_P9                         *((volatile  uint8_t *)(0x42DEEDA4UL))
#define bFM4_GPIO_PDSRB_P9                        *((volatile  uint8_t *)(0x42DEEDA4UL))
#define bFM_GPIO_PDSRB_PA                         *((volatile  uint8_t *)(0x42DEEDA8UL))
#define bFM4_GPIO_PDSRB_PA                        *((volatile  uint8_t *)(0x42DEEDA8UL))
#define bFM_GPIO_PDSRB_PB                         *((volatile  uint8_t *)(0x42DEEDACUL))
#define bFM4_GPIO_PDSRB_PB                        *((volatile  uint8_t *)(0x42DEEDACUL))
#define bFM_GPIO_PDSRB_PC                         *((volatile  uint8_t *)(0x42DEEDB0UL))
#define bFM4_GPIO_PDSRB_PC                        *((volatile  uint8_t *)(0x42DEEDB0UL))
#define bFM_GPIO_PDSRB_PD                         *((volatile  uint8_t *)(0x42DEEDB4UL))
#define bFM4_GPIO_PDSRB_PD                        *((volatile  uint8_t *)(0x42DEEDB4UL))
#define bFM_GPIO_PDSRB_PE                         *((volatile  uint8_t *)(0x42DEEDB8UL))
#define bFM4_GPIO_PDSRB_PE                        *((volatile  uint8_t *)(0x42DEEDB8UL))
#define bFM_GPIO_PDSRB_PF                         *((volatile  uint8_t *)(0x42DEEDBCUL))
#define bFM4_GPIO_PDSRB_PF                        *((volatile  uint8_t *)(0x42DEEDBCUL))

#define bFM_GPIO_PDSRC_P0                         *((volatile  uint8_t *)(0x42DEEE00UL))
#define bFM4_GPIO_PDSRC_P0                        *((volatile  uint8_t *)(0x42DEEE00UL))
#define bFM_GPIO_PDSRC_P1                         *((volatile  uint8_t *)(0x42DEEE04UL))
#define bFM4_GPIO_PDSRC_P1                        *((volatile  uint8_t *)(0x42DEEE04UL))
#define bFM_GPIO_PDSRC_P2                         *((volatile  uint8_t *)(0x42DEEE08UL))
#define bFM4_GPIO_PDSRC_P2                        *((volatile  uint8_t *)(0x42DEEE08UL))
#define bFM_GPIO_PDSRC_P3                         *((volatile  uint8_t *)(0x42DEEE0CUL))
#define bFM4_GPIO_PDSRC_P3                        *((volatile  uint8_t *)(0x42DEEE0CUL))
#define bFM_GPIO_PDSRC_P4                         *((volatile  uint8_t *)(0x42DEEE10UL))
#define bFM4_GPIO_PDSRC_P4                        *((volatile  uint8_t *)(0x42DEEE10UL))
#define bFM_GPIO_PDSRC_P5                         *((volatile  uint8_t *)(0x42DEEE14UL))
#define bFM4_GPIO_PDSRC_P5                        *((volatile  uint8_t *)(0x42DEEE14UL))
#define bFM_GPIO_PDSRC_P6                         *((volatile  uint8_t *)(0x42DEEE18UL))
#define bFM4_GPIO_PDSRC_P6                        *((volatile  uint8_t *)(0x42DEEE18UL))
#define bFM_GPIO_PDSRC_P7                         *((volatile  uint8_t *)(0x42DEEE1CUL))
#define bFM4_GPIO_PDSRC_P7                        *((volatile  uint8_t *)(0x42DEEE1CUL))
#define bFM_GPIO_PDSRC_P8                         *((volatile  uint8_t *)(0x42DEEE20UL))
#define bFM4_GPIO_PDSRC_P8                        *((volatile  uint8_t *)(0x42DEEE20UL))
#define bFM_GPIO_PDSRC_P9                         *((volatile  uint8_t *)(0x42DEEE24UL))
#define bFM4_GPIO_PDSRC_P9                        *((volatile  uint8_t *)(0x42DEEE24UL))
#define bFM_GPIO_PDSRC_PA                         *((volatile  uint8_t *)(0x42DEEE28UL))
#define bFM4_GPIO_PDSRC_PA                        *((volatile  uint8_t *)(0x42DEEE28UL))
#define bFM_GPIO_PDSRC_PB                         *((volatile  uint8_t *)(0x42DEEE2CUL))
#define bFM4_GPIO_PDSRC_PB                        *((volatile  uint8_t *)(0x42DEEE2CUL))
#define bFM_GPIO_PDSRC_PC                         *((volatile  uint8_t *)(0x42DEEE30UL))
#define bFM4_GPIO_PDSRC_PC                        *((volatile  uint8_t *)(0x42DEEE30UL))
#define bFM_GPIO_PDSRC_PD                         *((volatile  uint8_t *)(0x42DEEE34UL))
#define bFM4_GPIO_PDSRC_PD                        *((volatile  uint8_t *)(0x42DEEE34UL))
#define bFM_GPIO_PDSRC_PE                         *((volatile  uint8_t *)(0x42DEEE38UL))
#define bFM4_GPIO_PDSRC_PE                        *((volatile  uint8_t *)(0x42DEEE38UL))
#define bFM_GPIO_PDSRC_PF                         *((volatile  uint8_t *)(0x42DEEE3CUL))
#define bFM4_GPIO_PDSRC_PF                        *((volatile  uint8_t *)(0x42DEEE3CUL))

#define bFM_GPIO_PDSRD_P0                         *((volatile  uint8_t *)(0x42DEEE80UL))
#define bFM4_GPIO_PDSRD_P0                        *((volatile  uint8_t *)(0x42DEEE80UL))
#define bFM_GPIO_PDSRD_P1                         *((volatile  uint8_t *)(0x42DEEE84UL))
#define bFM4_GPIO_PDSRD_P1                        *((volatile  uint8_t *)(0x42DEEE84UL))
#define bFM_GPIO_PDSRD_P2                         *((volatile  uint8_t *)(0x42DEEE88UL))
#define bFM4_GPIO_PDSRD_P2                        *((volatile  uint8_t *)(0x42DEEE88UL))

#define bFM_GPIO_PDSRE_P0                         *((volatile  uint8_t *)(0x42DEEF00UL))
#define bFM4_GPIO_PDSRE_P0                        *((volatile  uint8_t *)(0x42DEEF00UL))
#define bFM_GPIO_PDSRE_P2                         *((volatile  uint8_t *)(0x42DEEF08UL))
#define bFM4_GPIO_PDSRE_P2                        *((volatile  uint8_t *)(0x42DEEF08UL))
#define bFM_GPIO_PDSRE_P3                         *((volatile  uint8_t *)(0x42DEEF0CUL))
#define bFM4_GPIO_PDSRE_P3                        *((volatile  uint8_t *)(0x42DEEF0CUL))

#define bFM_GPIO_PDSRF_P0                         *((volatile  uint8_t *)(0x42DEEF80UL))
#define bFM4_GPIO_PDSRF_P0                        *((volatile  uint8_t *)(0x42DEEF80UL))
#define bFM_GPIO_PDSRF_P1                         *((volatile  uint8_t *)(0x42DEEF84UL))
#define bFM4_GPIO_PDSRF_P1                        *((volatile  uint8_t *)(0x42DEEF84UL))
#define bFM_GPIO_PDSRF_P2                         *((volatile  uint8_t *)(0x42DEEF88UL))
#define bFM4_GPIO_PDSRF_P2                        *((volatile  uint8_t *)(0x42DEEF88UL))
#define bFM_GPIO_PDSRF_P3                         *((volatile  uint8_t *)(0x42DEEF8CUL))
#define bFM4_GPIO_PDSRF_P3                        *((volatile  uint8_t *)(0x42DEEF8CUL))
#define bFM_GPIO_PDSRF_P4                         *((volatile  uint8_t *)(0x42DEEF90UL))
#define bFM4_GPIO_PDSRF_P4                        *((volatile  uint8_t *)(0x42DEEF90UL))
#define bFM_GPIO_PDSRF_P5                         *((volatile  uint8_t *)(0x42DEEF94UL))
#define bFM4_GPIO_PDSRF_P5                        *((volatile  uint8_t *)(0x42DEEF94UL))
#define bFM_GPIO_PDSRF_P6                         *((volatile  uint8_t *)(0x42DEEF98UL))
#define bFM4_GPIO_PDSRF_P6                        *((volatile  uint8_t *)(0x42DEEF98UL))
#define bFM_GPIO_PDSRF_P7                         *((volatile  uint8_t *)(0x42DEEF9CUL))
#define bFM4_GPIO_PDSRF_P7                        *((volatile  uint8_t *)(0x42DEEF9CUL))
#define bFM_GPIO_PDSRF_P8                         *((volatile  uint8_t *)(0x42DEEFA0UL))
#define bFM4_GPIO_PDSRF_P8                        *((volatile  uint8_t *)(0x42DEEFA0UL))
#define bFM_GPIO_PDSRF_P9                         *((volatile  uint8_t *)(0x42DEEFA4UL))
#define bFM4_GPIO_PDSRF_P9                        *((volatile  uint8_t *)(0x42DEEFA4UL))
#define bFM_GPIO_PDSRF_PA                         *((volatile  uint8_t *)(0x42DEEFA8UL))
#define bFM4_GPIO_PDSRF_PA                        *((volatile  uint8_t *)(0x42DEEFA8UL))
#define bFM_GPIO_PDSRF_PB                         *((volatile  uint8_t *)(0x42DEEFACUL))
#define bFM4_GPIO_PDSRF_PB                        *((volatile  uint8_t *)(0x42DEEFACUL))
#define bFM_GPIO_PDSRF_PC                         *((volatile  uint8_t *)(0x42DEEFB0UL))
#define bFM4_GPIO_PDSRF_PC                        *((volatile  uint8_t *)(0x42DEEFB0UL))

