mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
#define bFM_MFS13_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x4271A080UL))
#define bFM4_MFS13_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x4271A080UL))
#define bFM_MFS13_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x4271A084UL))
#define bFM4_MFS13_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x4271A084UL))
#define bFM_MFS13_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x4271A088UL))
#define bFM4_MFS13_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x4271A088UL))
#define bFM_MFS13_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271A08CUL))
#define bFM4_MFS13_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271A08CUL))
#define bFM_MFS13_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x4271A090UL))
#define bFM4_MFS13_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x4271A090UL))
#define bFM_MFS13_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x4271A094UL))
#define bFM4_MFS13_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x4271A094UL))
#define bFM_MFS13_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x4271A098UL))
#define bFM4_MFS13_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x4271A098UL))
#define bFM_MFS13_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271A09CUL))
#define bFM4_MFS13_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271A09CUL))

#define bFM_MFS13_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271A21CUL))
#define bFM4_MFS13_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271A21CUL))

#define bFM_MFS13_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271A23CUL))
#define bFM4_MFS13_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271A23CUL))

#define bFM_MFS13_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x4271A008UL))
#define bFM4_MFS13_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x4271A008UL))
#define bFM_MFS13_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271A00CUL))
#define bFM4_MFS13_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271A00CUL))

#define bFM_MFS13_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM4_MFS13_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM_MFS13_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM4_MFS13_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM_MFS13_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM4_MFS13_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM_MFS13_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM4_MFS13_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM_MFS13_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM4_MFS13_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM_MFS13_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM4_MFS13_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x4271A0B4UL))
#define bFM_MFS13_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x4271A0B8UL))
#define bFM4_MFS13_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x4271A0B8UL))
#define bFM_MFS13_I2C_SSR_REC                     *((volatile  uint8_t *)(0x4271A0BCUL))
#define bFM4_MFS13_I2C_SSR_REC                    *((volatile  uint8_t *)(0x4271A0BCUL))

#define bFM_MFS13_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x4271A1BCUL))
#define bFM4_MFS13_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x4271A1BCUL))

#define bFM_MFS13_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x4271A090UL))
#define bFM4_MFS13_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x4271A090UL))
#define bFM_MFS13_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x4271A098UL))
#define bFM4_MFS13_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x4271A098UL))

#define bFM_MFS13_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x4271A280UL))
#define bFM4_MFS13_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x4271A280UL))
#define bFM_MFS13_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x4271A284UL))
#define bFM4_MFS13_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x4271A284UL))
#define bFM_MFS13_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x4271A288UL))
#define bFM4_MFS13_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x4271A288UL))
#define bFM_MFS13_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM4_MFS13_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM_MFS13_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x4271A290UL))
#define bFM4_MFS13_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x4271A290UL))
#define bFM_MFS13_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x4271A294UL))
#define bFM4_MFS13_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x4271A294UL))
#define bFM_MFS13_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x4271A298UL))
#define bFM4_MFS13_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x4271A298UL))
#define bFM_MFS13_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM4_MFS13_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM_MFS13_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM4_MFS13_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM_MFS13_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM4_MFS13_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM_MFS13_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM4_MFS13_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM_MFS13_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271A2B0UL))
#define bFM4_MFS13_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271A2B0UL))

#define bFM_MFS13_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x4271A020UL))
#define bFM4_MFS13_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x4271A020UL))
#define bFM_MFS13_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x4271A024UL))
#define bFM4_MFS13_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x4271A024UL))
#define bFM_MFS13_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x4271A028UL))
#define bFM4_MFS13_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x4271A028UL))
#define bFM_MFS13_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM4_MFS13_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM_MFS13_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x4271A030UL))
#define bFM4_MFS13_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x4271A030UL))
#define bFM_MFS13_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x4271A034UL))
#define bFM4_MFS13_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x4271A034UL))
#define bFM_MFS13_LIN_SCR_MS                      *((volatile  uint8_t *)(0x4271A038UL))
#define bFM4_MFS13_LIN_SCR_MS                     *((volatile  uint8_t *)(0x4271A038UL))
#define bFM_MFS13_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271A03CUL))
#define bFM4_MFS13_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271A03CUL))

