mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xl/common/s6e2c3xl.h
#define bFM_MFS14_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x4271C000UL))
#define bFM4_MFS14_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x4271C000UL))
#define bFM_MFS14_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x4271C004UL))
#define bFM4_MFS14_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x4271C004UL))
#define bFM_MFS14_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x4271C008UL))
#define bFM4_MFS14_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x4271C008UL))
#define bFM_MFS14_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271C00CUL))
#define bFM4_MFS14_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271C00CUL))

#define bFM_MFS14_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM4_MFS14_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM_MFS14_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM4_MFS14_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM_MFS14_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM4_MFS14_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM_MFS14_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM4_MFS14_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM_MFS14_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM4_MFS14_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM_MFS14_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x4271C0BCUL))
#define bFM4_MFS14_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x4271C0BCUL))

#define bFM_MFS14_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x4271C3A0UL))
#define bFM4_MFS14_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x4271C3A0UL))
#define bFM_MFS14_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x4271C3A4UL))
#define bFM4_MFS14_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x4271C3A4UL))
#define bFM_MFS14_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x4271C3A8UL))
#define bFM4_MFS14_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x4271C3A8UL))
#define bFM_MFS14_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x4271C3ACUL))
#define bFM4_MFS14_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x4271C3ACUL))
#define bFM_MFS14_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x4271C3B0UL))
#define bFM4_MFS14_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x4271C3B0UL))
#define bFM_MFS14_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x4271C3B4UL))
#define bFM4_MFS14_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x4271C3B4UL))

#define bFM_MFS14_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x4271C280UL))
#define bFM_MFS14_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x4271C284UL))
#define bFM_MFS14_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x4271C288UL))
#define bFM_MFS14_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271C28CUL))
#define bFM_MFS14_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x4271C290UL))
#define bFM_MFS14_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x4271C294UL))
#define bFM_MFS14_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x4271C298UL))
#define bFM_MFS14_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x4271C2A0UL))
#define bFM_MFS14_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x4271C2A4UL))
#define bFM_MFS14_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271C2A8UL))
#define bFM_MFS14_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271C2ACUL))
#define bFM_MFS14_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271C2B0UL))

#define bFM_MFS14_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x4271C020UL))
#define bFM4_MFS14_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x4271C020UL))
#define bFM_MFS14_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x4271C024UL))
#define bFM4_MFS14_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x4271C024UL))
#define bFM_MFS14_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x4271C028UL))
#define bFM4_MFS14_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x4271C028UL))
#define bFM_MFS14_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM4_MFS14_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271C02CUL))
#define bFM_MFS14_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x4271C030UL))
#define bFM4_MFS14_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x4271C030UL))
#define bFM_MFS14_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x4271C034UL))
#define bFM4_MFS14_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x4271C034UL))
#define bFM_MFS14_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x4271C038UL))
#define bFM_MFS14_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271C03CUL))
#define bFM4_MFS14_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271C03CUL))

#define bFM_MFS14_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x4271C080UL))
#define bFM4_MFS14_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x4271C080UL))
#define bFM_MFS14_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x4271C084UL))
#define bFM4_MFS14_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x4271C084UL))
#define bFM_MFS14_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x4271C088UL))
#define bFM4_MFS14_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x4271C088UL))
#define bFM_MFS14_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271C08CUL))
#define bFM4_MFS14_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271C08CUL))
#define bFM_MFS14_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x4271C090UL))
#define bFM4_MFS14_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x4271C090UL))
#define bFM_MFS14_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x4271C094UL))
#define bFM4_MFS14_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x4271C094UL))
#define bFM_MFS14_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x4271C098UL))
#define bFM4_MFS14_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x4271C098UL))
#define bFM_MFS14_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271C09CUL))
#define bFM4_MFS14_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271C09CUL))

#define bFM_MFS14_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271C21CUL))
#define bFM4_MFS14_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271C21CUL))

#define bFM_MFS14_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271C23CUL))
#define bFM4_MFS14_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271C23CUL))

#define bFM_MFS14_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x4271C008UL))
#define bFM4_MFS14_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x4271C008UL))
#define bFM_MFS14_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271C00CUL))
#define bFM4_MFS14_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271C00CUL))

#define bFM_MFS14_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM4_MFS14_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x4271C0A0UL))
#define bFM_MFS14_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM4_MFS14_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x4271C0A4UL))
#define bFM_MFS14_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM4_MFS14_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x4271C0A8UL))
#define bFM_MFS14_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM4_MFS14_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x4271C0ACUL))
#define bFM_MFS14_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM4_MFS14_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x4271C0B0UL))
#define bFM_MFS14_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM4_MFS14_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x4271C0B4UL))
#define bFM_MFS14_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x4271C0B8UL))
#define bFM4_MFS14_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x4271C0B8UL))
#define bFM_MFS14_I2C_SSR_REC                     *((volatile  uint8_t *)(0x4271C0BCUL))
#define bFM4_MFS14_I2C_SSR_REC                    *((volatile  uint8_t *)(0x4271C0BCUL))

#define bFM_MFS14_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x4271C1BCUL))

